# 7.1 处理缺失值

In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame
string_data = pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## 7.1.1 过滤缺失值

In [5]:
from numpy import nan as NA
data = pd.Series([1,NA,3.5,NA,7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [7]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data[4]  = NA

In [11]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [14]:
df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4,1] = NA
df.iloc[:2,2] = NA
df

          0         1         2
0 -0.338365       NaN       NaN
1  0.855013       NaN       NaN
2 -0.127564       NaN -1.593581
3  0.371830       NaN  0.729629
4 -0.926620 -1.090607  0.029154
5 -1.267580 -2.168491  0.931905
6  0.584182 -0.195747  0.976381

In [15]:
df.dropna()

          0         1         2
4 -0.926620 -1.090607  0.029154
5 -1.267580 -2.168491  0.931905
6  0.584182 -0.195747  0.976381

In [16]:
df.dropna(thresh=2)

          0         1         2
2 -0.127564       NaN -1.593581
3  0.371830       NaN  0.729629
4 -0.926620 -1.090607  0.029154
5 -1.267580 -2.168491  0.931905
6  0.584182 -0.195747  0.976381

## 7.1.2 补偿缺失值

In [17]:
df.fillna(0)

          0         1         2
0 -0.338365  0.000000  0.000000
1  0.855013  0.000000  0.000000
2 -0.127564  0.000000 -1.593581
3  0.371830  0.000000  0.729629
4 -0.926620 -1.090607  0.029154
5 -1.267580 -2.168491  0.931905
6  0.584182 -0.195747  0.976381

In [18]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.338365  0.500000  0.000000
1  0.855013  0.500000  0.000000
2 -0.127564  0.500000 -1.593581
3  0.371830  0.500000  0.729629
4 -0.926620 -1.090607  0.029154
5 -1.267580 -2.168491  0.931905
6  0.584182 -0.195747  0.976381

In [19]:
df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:,1] = NA
df.iloc[4:,2] = NA
df

          0         1         2
0  0.678732 -1.066698  1.115611
1 -0.826066  0.254067  1.048801
2 -1.278849       NaN  0.856256
3 -0.699663       NaN -0.812211
4 -0.140028       NaN       NaN
5  0.947267       NaN       NaN

In [20]:
df.fillna(method='ffill')

          0         1         2
0  0.678732 -1.066698  1.115611
1 -0.826066  0.254067  1.048801
2 -1.278849  0.254067  0.856256
3 -0.699663  0.254067 -0.812211
4 -0.140028  0.254067 -0.812211
5  0.947267  0.254067 -0.812211

In [21]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.678732 -1.066698  1.115611
1 -0.826066  0.254067  1.048801
2 -1.278849  0.254067  0.856256
3 -0.699663  0.254067 -0.812211
4 -0.140028       NaN -0.812211
5  0.947267       NaN -0.812211

In [22]:
data = pd.Series([1.,NA,3.5,NA,7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 7.2 数据转换

## 7.2.1 删除重复值

In [23]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],
                    'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [24]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [25]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data['v1'] = range(7)
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [30]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [31]:
data = pd.Series([1.,-999,2.,-999,-1000,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [32]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [33]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [34]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [35]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

## 7.2.4 重命名轴索引

In [36]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index=['Ohio','Colorado','New York'],
                   columns=['one','two','three','four'])
transform = lambda x:x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [37]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [38]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [39]:
data.rename(index={'OHIO':'INDIANA'},
           columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [41]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

## 7.2.5 离散化和分箱

In [42]:
ages = [20,22,25,27,21,23,37,31,61,45,41,32]
bins = [18,25,35,60,100]
cats = pd.cut(ages,bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [43]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [44]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [45]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [46]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [47]:
group_names = ['Youth','YouthAdult','MiddleAged','Senior']
pd.cut(ages,bins,labels = group_names)

[Youth, Youth, Youth, YouthAdult, Youth, ..., YouthAdult, Senior, MiddleAged, MiddleAged, YouthAdult]
Length: 12
Categories (4, object): [Youth < YouthAdult < MiddleAged < Senior]

In [48]:
data = np.random.rand(20)
pd.cut(data,4,precision=2)

[(0.25, 0.5], (0.74, 0.99], (0.25, 0.5], (0.5, 0.74], (0.5, 0.74], ..., (0.74, 0.99], (0.0012, 0.25], (0.0012, 0.25], (0.74, 0.99], (0.74, 0.99]]
Length: 20
Categories (4, interval[float64]): [(0.0012, 0.25] < (0.25, 0.5] < (0.5, 0.74] < (0.74, 0.99]]

In [50]:
data = np.random.randn(1000)
cats = pd.qcut(data,4)
cats

[(-3.209, -0.687], (-3.209, -0.687], (-0.687, -0.0183], (-0.0183, 0.686], (-0.687, -0.0183], ..., (0.686, 3.354], (-0.687, -0.0183], (-3.209, -0.687], (0.686, 3.354], (0.686, 3.354]]
Length: 1000
Categories (4, interval[float64]): [(-3.209, -0.687] < (-0.687, -0.0183] < (-0.0183, 0.686] < (0.686, 3.354]]

In [51]:
pd.value_counts(cats)

(0.686, 3.354]       250
(-0.0183, 0.686]     250
(-0.687, -0.0183]    250
(-3.209, -0.687]     250
dtype: int64

## 7.2.6 检测和过滤异常值

In [52]:
data = pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007349     0.038123    -0.008708    -0.029319
std       0.974426     1.038578     1.012792     1.024154
min      -2.959381    -3.216612    -3.992911    -3.462593
25%      -0.664188    -0.701662    -0.680480    -0.698404
50%      -0.011670    -0.014428    -0.002204    -0.020932
75%       0.654659     0.747454     0.689222     0.653090
max       3.300380     3.308670     3.611584     3.203905

## 7.2.7 置换和随机抽样

In [53]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))
sampler = np.random.permutation(5)
sampler

array([2, 0, 1, 3, 4])

In [54]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [55]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
0   0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [59]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [61]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

2   -1
2   -1
2   -1
2   -1
4    4
3    6
4    4
3    6
4    4
3    6
dtype: int64

In [62]:
choices = pd.Series([5,7,-1,6,4])
draws = choices.sample(n=10,replace=True)
draws

1    7
1    7
2   -1
3    6
0    5
3    6
2   -1
0    5
0    5
4    4
dtype: int64

# 7.3 字符串操作

## 7.3.1字符串对象方法

In [63]:
val = 'a,b,  guido'
val.split(',')

['a', 'b', '  guido']

In [64]:
pieces = [x.strip() for x in val.split(',')]
pieces

['a', 'b', 'guido']

In [65]:
first,second,third = pieces
first+'::'+second+'::'+third

'a::b::guido'

In [66]:
'::'.join(pieces)

'a::b::guido'

In [67]:
'guido' in val

True

In [68]:
val.index(',')

1

In [69]:
val.find(':')

-1

In [70]:
val.count(',')

2

In [71]:
val.replace(',','::')

'a::b::  guido'

In [72]:
val.replace(',','')

'ab  guido'

## 7.3.2 正则表达式

In [1]:
import re
text ='foo   bar\t baz  \tqux'
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [2]:
regex = re.compile('\s+')
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [3]:
regex.findall(text)

['   ', '\t ', '  \t']

## 7.3.3 pandas中的向量化字符串函数

In [5]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame
data = {'Dave':'dave@google.com','Steve':'steve@gmail.com',
       'Rob':'rob@gmail.com','Wes':np.nan}
data = pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [6]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [7]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [8]:
pattern

NameError: name 'pattern' is not defined